kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  printf("  TX stopped cleanly (DAC set to mid)\r\n");
}

void Set_DAC_Output_To_Midlevel(void) {
  CLEAR_BIT(DAC1->CR, DAC_CR_TEN1);

  // Ensure DAC channel is enabled
  HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);

  // Set mid-scale (12-bit right aligned)
  HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dc_mid[0]);
}

HAL_StatusTypeDef CC1101_Strobe(uint8_t strobe, uint8_t *status) {
  uint8_t tx[1] = {strobe};
  uint8_t rx[1] = {0};

  HAL_StatusTypeDef st = SPI1_WriteRead(tx, rx, 1);
  if (st == HAL_OK && status)
    *status = rx[0];
  printf("CC1101 Strobe 0x%02X, status=0x%02X\r\n", strobe, rx[0]);
  return st;
}

HAL_StatusTypeDef CC1101_ReadReg(uint8_t addr, uint8_t *val, uint8_t *status) {
  uint8_t tx[2] = {(uint8_t)(addr | 0x80), 0xFF};
  uint8_t rx[2] = {0};

  HAL_StatusTypeDef st = SPI1_WriteRead(tx, rx, 2);
  if (st == HAL_OK) {
    if (status)
      *status = rx[0];
    if (val)
      *val = rx[1];
  }
  return st;
}

HAL_StatusTypeDef CC1101_WriteReg(uint8_t addr, uint8_t val, uint8_t *status) {
  uint8_t tx[2] = {(uint8_t)(addr & 0x7F), val};
  uint8_t rx[2] = {0};

  HAL_StatusTypeDef st = SPI1_WriteRead(tx, rx, 2);
  if (st == HAL_OK && status)
    *status = rx[1]; // status comes back while sending addr
  printf("CC1101 WriteReg 0x%02X=0x%02X, status=0x%02X\r\n", addr, val, rx[1]);
  return st;
}

HAL_StatusTypeDef CC1101_WriteBurstReg(uint8_t addr, uint8_t *vals, size_t len,
                                       uint8_t *status) {
  if (len == 0)
    return HAL_OK;

  uint8_t tx[len + 1];
  uint8_t rx[len + 1];

  tx[0] = (uint8_t)(addr | 0x40); // burst write
  memcpy(&tx[1], vals, len);

  HAL_StatusTypeDef st = SPI1_WriteRead(tx, rx, len + 1);
  if (st == HAL_OK && status)
    *status = rx[0];
  printf("CC1101 WriteBurstReg 0x%02X, len=%d, status=0x%02X\r\n", addr, len,
         rx[0]);
  return st;
}

void transmit_bytes(void) {
  size_t len_bytes = 1;
  printf("Transmitting %d bytes...\r\n", len_bytes);
  uint8_t status = 0;

  // for (size_t i = 0; i < len_bytes; i++) {
  //   CC1101_WriteReg(0x3F, 0x69,
  //                   &status); // Write 1 byte to TX FIFO (example data)

  //   HAL_Delay(100); // Wait for transmission to complete
  // }

  uint8_t pkt[2] = {0x01, 0x69}; // length=1, payload=0x69

  CC1101_WriteBurstReg(0x3F, pkt, 2, &status);

  CC1101_Strobe(0x35, &status); // Go to TX state (STX)

  printf("Transmission complete.\r\n");
}

void app_radio_test(void) {
  printf("Starting radio test...\r\n");

  uint8_t status = 0;
  uint8_t part = 0, ver = 0;
  uint8_t temp = 0;

  // Reset (strobe)
  CC1101_Strobe(0x30, &status);
  HAL_Delay(1);

  // Read PARTNUM + VERSION
  CC1101_ReadReg(0xF1, &part, &status);
  CC1101_ReadReg(0x00, &ver, &status);

  printf("CC1101 PARTNUM=0x%02X VERSION=0x%02X\r\n", part, ver);

  if (RX == true) {
    // Write configuration for RX
    for (int i = 0; i < sizeof(cc1101_cfg_rx) / sizeof(ism_reg_t); i++) {
      CC1101_WriteReg(cc1101_cfg_rx[i].addr, cc1101_cfg_rx[i].value, &status);
    }

    CC1101_ReadReg(0x0D, &temp, &status); // Read FREQ2 register as example
    printf("FREQ2 register: 0x%02X\r\n", temp);
    CC1101_ReadReg(0x0E, &temp, &status); // Read FREQ1 register as example
    printf("FREQ1 register: 0x%02X\r\n", temp);
    CC1101_ReadReg(0x0F, &temp, &status); // Read FREQ0 register as example
    printf("FREQ0 register: 0x%02X\r\n", temp);

    CC1101_Strobe(0x34, &status); // Go to RX state (SRX)

    CC1101_ReadReg(0xF5, &temp,
                   &status); // Read MARCSTATE to confirm RX state entered

    printf("MARCSTATE after RX strobe: 0x%02X\r\n", temp);

    HAL_Delay(3000); // Wait 10 seconds in RX

    CC1101_ReadReg(0xF5, &temp,
                   &status); // Read MARCSTATE to confirm RX state entered

    printf("MARCSTATE after RX strobe: 0x%02X\r\n", temp);
  } else {
    // Write configuration for TX
    for (int i = 0; i < sizeof(cc1101_cfg_tx) / sizeof(ism_reg_t); i++) {
      CC1101_WriteReg(cc1101_cfg_tx[i].addr, cc1101_cfg_tx[i].value, &status);
    }

    CC1101_ReadReg(0x0D, &temp, &status); // Read FREQ2 register as example
    printf("FREQ2 register: 0x%02X\r\n", temp);
    CC1101_ReadReg(0x0E, &temp, &status); // Read FREQ1 register as example
    printf("FREQ1 register: 0x%02X\r\n", temp);
    CC1101_ReadReg(0x0F, &temp, &status); // Read FREQ0 register as example
    printf("FREQ0 register: 0x%02X\r\n", temp);

    transmit_bytes();

    CC1101_ReadReg(0xF5, &temp,
                   &status); // Read MARCSTATE to confirm TX state entered

    printf("MARCSTATE after TX strobe: 0x%02X\r\n", temp);

    HAL_Delay(3000); // Wait 3 seconds in TX

    CC1101_ReadReg(0xF5, &temp,
                   &status); // Read MARCSTATE to confirm TX state entered

    printf("MARCSTATE after TX strobe: 0x%02X\r\n", temp);
  }

  printf("Radio test complete.\r\n");
}

void read_buffer(void) {
  uint8_t status = 0;
  uint8_t temp = 0;

  CC1101_ReadReg(0xFB, &temp,
                 &status); // Read RXBYTES to confirm bytes in RX FIFO
  printf("Bytes in RX FIFO: 0x%02X\r\n", temp);
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
